#приймущества - делегирование задач и удубства в том что можно задать изначальный функцианал(свойства) и потом добавлять к нему то что необходимо для создания оъекта (методы, доп действия), понятность и читаемость
#недостатки - больше памяти занимает, избыточность кода и усложненная архитектура

#основные принципы oop - наследование, инкапсуляция и полеморфизм. также есть абстракция
#принципы взаимодейтвия - ассоциация, композиция, агрегация
#инкапсуляция - представление оъекта в виде набора свойств и методов и сокрытие их(сокрытие данных)
#абстракция - возможность описания чего либо без привязки к частности
#полеморфизм - использование методов в классах схожих по назначению, но разных по реализации
#
#
#
#1) методы экземпляра класса - к которым есть доступ из под оъектов
#2)абстрактные методы - методы без реализации
#3)  1)методы мутаторы - позваляют изменять значение свойства(setter) 2)акцессоры - получать значения свойств(getter)
####диаграмма класса, асоциация, отношения, агригация!!!, композиция (все виды связей и взаимоотношений), уровни абстракций, какими стрелочками обозначваются принципы взаимодействия

#методы конструкторы - вызываются автоматически при создании объектов, нужны для первичной инициализации оъекта
#деструкторы - вызываются автоматически при удалении оъектов
#статические методы - вызываются из под класса для всех оъектов
#модификаторы доступа - применяются и к полям и к методам

#типы:
#
# 1) - private (доступ только из класса в котором находится объект)
# 2) - protected (доступ только из класса и сабклассов)
# 3) - pubclic (доступ откуда угодно)


#наследование - расширение функционала класса в сабклассах множественные наследования




